import React from "react";
import "./style.css";

const About = ({ sectionRef }) => {
  return (
    <section className="about" ref={sectionRef}>
      <div className="container " id="container__about">
        <div className="container__about_info">
          <div className="about__block reveal">
            <img src="photo_2.png" width="100%" alt="Ученики" />
            <div>
              <h2>
                О <span className="colored-span">ШКОЛЕ</span>
              </h2>
              <article>
                <p>
                  В нашей школе мы учитываем личностные особенности ребёнка и
                  помогаем ему более щадящим способом овладеть базовыми, а также
                  углубленными знаниями в математике, английском и китайском
                  языках.
                </p>
                <p>
                  Дополнительные занятия и кружки помогают раскрыть таланты
                  детей и сформировать осознанную личность, подготовленную к
                  взрослой жизни.
                </p>
              </article>
            </div>
          </div>
          <div className="about__block reveal">
            <div>
              <h2>
                ИСТОРИЯ <span className="colored-span"> СОЗДАНИЯ</span>
              </h2>
              <article>
                <p>
                  Приветствую, меня зовут Ермилова Ольга. Я более 18 лет являюсь
                  основателем и лидером группы компаний DIKO. А также
                  предпринимателем, сертифицированным коучем и психологом.
                </p>
                <p>
                  Мы с мужем Игнатом являемся родителями Федора 12 лет, Мирона 8
                  лет и Таисии 7 лет.
                </p>
                <p>
                  Воспитывая абсолютно разных троих детей, мы приобрели опыт
                  обучения в разных школах, в том числе за границей. За это
                  время мы укоренились в своем намерении принять на себя
                  ответственность за образование и развитие детей и открыть свою
                  уникальную школу с подходом, который учитывает индивидуальные
                  особенности детей, проявлят их сильные стороны и помогает
                  найти внутреннюю опору и мотивацию в рамках учебного процесса
                  и в жизни в целом.
                </p>
              </article>
            </div>
            <img src="deco3.svg" id="deco__about_circle" alt="узор" />
            <img src="deco4.svg" id="deco__about_triangle" alt="узор" />
            <img src="photo_3.png" width="100%" alt="Наша семья" />
          </div>
        </div>

        <div className="reveal ">
          <h2>
            <span className="colored-span">ПРЕИМУЩЕСТВА</span>
          </h2>
          <div className="advantages__block">
            <div>
              <svg
                viewBox="0 0 50 50"
                fill="none"
                xmlns="http://www.w3.org/2000/svg"
              >
                <path
                  d="M23.833325 44.66675C35.3395 44.66675 44.66675 35.3395 44.66675 23.833325C44.66675 12.327075 35.3395 3 23.833325 3C12.327075 3 3 12.327075 3 23.833325C3 35.3395 12.327075 44.66675 23.833325 44.66675Z"
                  stroke="#E82485"
                  stroke-width="4"
                  stroke-linejoin="round"
                ></path>
                <path
                  d="M23.8418 11.333375V23.8438L32.674 32.677"
                  stroke="#E82485"
                  stroke-width="4"
                  stroke-linecap="round"
                  stroke-linejoin="round"
                ></path>
              </svg>
              <h3>Ускоренное обучение</h3>
              <p>
                Используем методы и инструменты, благодаря которым дети быстрее
                и проще усваивают материал
              </p>
            </div>
            <div>
              <svg
                viewBox="0 0 50 50"
                fill="none"
                xmlns="http://www.w3.org/2000/svg"
              >
                <path
                  d="M9.615375 14.615375C9.615375 13.85775 9.7646 13.10755 10.05455 12.4076C10.344475 11.70765 10.769425 11.07165 11.30515 10.535925C11.840875 10.0002 12.476875 9.57525 13.176825 9.2853C13.876775 8.995375 14.627 8.84615 15.384625 8.84615C16.14225 8.84615 16.89245 8.995375 17.5924 9.2853C18.29235 9.57525 18.92835 10.0002 19.464075 10.535925C19.9998 11.07165 20.42475 11.70765 20.7147 12.4076C21.004625 13.10755 21.15385 13.85775 21.15385 14.615375C21.15385 16.145475 20.546025 17.6129 19.464075 18.69485C18.382125 19.7768 16.9147 20.384625 15.384625 20.384625C13.854525 20.384625 12.3871 19.7768 11.30515 18.69485C10.2232 17.6129 9.615375 16.145475 9.615375 14.615375ZM15.384625 5C12.83445 5 10.38875 6.01305 8.5855 7.816275C6.782275 9.619525 5.769225 12.065225 5.769225 14.615375C5.769225 17.16555 6.782275 19.61125 8.5855 21.4145C10.38875 23.217725 12.83445 24.230775 15.384625 24.230775C17.934775 24.230775 20.380475 23.217725 22.183725 21.4145C23.98695 19.61125 25 17.16555 25 14.615375C25 12.065225 23.98695 9.619525 22.183725 7.816275C20.380475 6.01305 17.934775 5 15.384625 5ZM34.6155 16.53845C34.6155 15.5184 35.0205 14.540125 35.742 13.818825C36.46325 13.097525 37.4415 12.6923 38.4615 12.6923C39.4815 12.6923 40.46 13.097525 41.18125 13.818825C41.9025 14.540125 42.30775 15.5184 42.30775 16.53845C42.30775 17.558525 41.9025 18.5368 41.18125 19.2581C40.46 19.9794 39.4815 20.384625 38.4615 20.384625C37.4415 20.384625 36.46325 19.9794 35.742 19.2581C35.0205 18.5368 34.6155 17.558525 34.6155 16.53845ZM38.4615 8.84615C36.4215 8.84615 34.46475 9.6566 33.02225 11.099175C31.57975 12.541775 30.76925 14.498325 30.76925 16.53845C30.76925 18.5786 31.57975 20.53515 33.02225 21.97775C34.46475 23.420325 36.4215 24.230775 38.4615 24.230775C40.50175 24.230775 42.45825 23.420325 43.90075 21.97775C45.3435 20.53515 46.15375 18.5786 46.15375 16.53845C46.15375 14.498325 45.3435 12.541775 43.90075 11.099175C42.45825 9.6566 40.50175 8.84615 38.4615 8.84615ZM0 33.84625C0 32.316 0.6078275 30.84875 1.6897675 29.76675C2.7717 28.68475 4.239125 28.077 5.769225 28.077H25C26.53 28.077 27.9975 28.68475 29.0795 29.76675C30.1615 30.84875 30.76925 32.316 30.76925 33.84625V34.277C30.76525 34.453 30.75225 34.629 30.73075 34.80375C30.5115 36.6685 29.81775 38.4455 28.7155 39.9655C26.6115 42.86925 22.61155 45.3845 15.384625 45.3845C8.16155 45.3845 4.16155 42.86925 2.05 39.9655C0.9490825 38.44525 0.2565 36.668 0.0384615 34.80375C0.019313925 34.62875 0.0064851 34.453 0 34.277V33.84625ZM3.84615 34.19225V34.21925L3.86155 34.40775C4.010475 35.59825 4.45765 36.732 5.16155 37.70375C6.415375 39.427 9.14615 41.5385 15.384625 41.5385C21.623075 41.5385 24.35385 39.427 25.60775 37.70375C26.3115 36.732 26.75875 35.59825 26.90775 34.40775C26.9145 34.34375 26.91975 34.2795 26.923 34.2155V33.84625C26.923 33.336 26.7205 32.847 26.35975 32.48625C25.99925 32.12575 25.51 31.923 25 31.923H5.769225C5.2592 31.923 4.77005 32.12575 4.4094 32.48625C4.048775 32.847 3.84615 33.336 3.84615 33.84625V34.19225ZM38.4615 41.5385C36.2 41.5385 34.34625 41.19225 32.84625 40.623C33.46275 39.4935 33.9295 38.2885 34.2345 37.0385C35.2655 37.427 36.6345 37.69225 38.4615 37.69225C42.7655 37.69225 44.53075 36.223 45.30775 35.13075C45.76175 34.49375 46.05 33.7535 46.14625 32.977L46.15375 32.86925C46.14975 32.617 46.04675 32.37625 45.86675 32.19925C45.687 32.02225 45.44475 31.923 45.19225 31.923H34.423C34.13925 30.52825 33.54775 29.2145 32.69225 28.077H45.19225C47.84625 28.077 50 30.23075 50 32.8845V32.95C49.9955 33.09 49.98525 33.23 49.96925 33.36925C49.80625 34.81075 49.2795 36.18725 48.4385 37.36925C46.8155 39.64225 43.773 41.5385 38.4615 41.5385Z"
                  fill="#E82485"
                ></path>
              </svg>
              <h3>Небольшой класс</h3>
              <p>
                В классе не более 8 учеников. Ваш ребенок точно получит должное
                внимание и помощь от учителей
              </p>
            </div>
            <div>
              <svg
                viewBox="0 0 50 50"
                fill="none"
                xmlns="http://www.w3.org/2000/svg"
              >
                <path
                  d="M24.999675 39.58325H34.37475C36.3085 39.58325 38.16325 38.815 39.53075 37.44775C40.898 36.08025 41.66625 34.2255 41.66625 32.29175C41.66625 30.35775 40.898 28.50325 39.53075 27.13575C38.16325 25.76825 36.3085 25 34.37475 25H17.708C15.774125 25 13.919475 24.231775 12.552025 22.864325C11.184575 21.496875 10.41635 19.6422 10.41635 17.708325C10.41635 15.774475 11.184575 13.9198 12.552025 12.55235C13.919475 11.1849 15.774125 10.416675 17.708 10.416675H24.999675M8.333 39.58325C8.333 40.6885 8.772 41.74825 9.5534 42.5295C10.3348 43.311 11.3946 43.75 12.499675 43.75C13.60475 43.75 14.66455 43.311 15.44595 42.5295C16.22735 41.74825 16.66635 40.6885 16.66635 39.58325C16.66635 38.47825 16.22735 37.4185 15.44595 36.637C14.66455 35.85575 13.60475 35.41675 12.499675 35.41675C11.3946 35.41675 10.3348 35.85575 9.5534 36.637C8.772 37.4185 8.333 38.47825 8.333 39.58325ZM33.333 10.416675C33.333 11.521725 33.772 12.58155 34.5535 13.36295C35.33475 14.14435 36.3945 14.583325 37.49975 14.583325C38.60475 14.583325 39.6645 14.14435 40.446 13.36295C41.22725 12.58155 41.66625 11.521725 41.66625 10.416675C41.66625 9.3116 41.22725 8.2518 40.446 7.4704C39.6645 6.688975 38.60475 6.25 37.49975 6.25C36.3945 6.25 35.33475 6.688975 34.5535 7.4704C33.772 8.2518 33.333 9.3116 33.333 10.416675Z"
                  stroke="#E82485"
                  stroke-width="4"
                  stroke-linecap="round"
                  stroke-linejoin="round"
                ></path>
              </svg>
              <h3>Индивидуальная траектория</h3>
              <p>
                Все дети уникальны. Именно поэтому мы составляем учебную
                траекторию, учитывая особенности каждого ребёнка
              </p>
            </div>
            <div>
              <svg
                viewBox="0 0 50 50"
                fill="none"
                xmlns="http://www.w3.org/2000/svg"
              >
                <path
                  d="M25 41.55625C21.959625 39.801 18.510725 38.87675 15 38.87675C11.489275 38.87675 8.040375 39.801 5 41.55625V12.667475C8.040375 10.9121 11.489275 9.987975 15 9.987975C18.510725 9.987975 21.959625 10.9121 25 12.667475M25 41.55625C28.0405 39.801 31.48925 38.87675 35 38.87675C38.51075 38.87675 41.9595 39.801 45 41.55625V12.667475C41.9595 10.9121 38.51075 9.987975 35 9.987975C31.48925 9.987975 28.0405 10.9121 25 12.667475M25 41.55625V12.667475"
                  stroke="#E82485"
                  stroke-width="4"
                  stroke-linecap="round"
                  stroke-linejoin="round"
                ></path>
              </svg>
              <h3>Помощь в домашнем задании</h3>
              <p>
                Ученики выполняют домашнее задание в школе и всегда могут
                обратиться к учителю за объяснением любой темы
              </p>
            </div>
            <div>
              <img src="head.svg" />
              <h3>Формирование личности</h3>
              <p>
                Ваш ребёнок научится отстаивать своё мнение, контролировать
                эмоции, а также овладеет финансовой грамотностью и другими
                полезными для жизни навыками
              </p>
            </div>
            <div>
              <svg
                viewBox="0 0 50 50"
                fill="none"
                xmlns="http://www.w3.org/2000/svg"
              >
                <path
                  d="M25.00025 45.83325C36.50625 45.83325 45.83375 36.506 45.83375 25C45.83375 13.494075 36.50625 4.166675 25.00025 4.166675C13.4944 4.166675 4.167 13.494075 4.167 25C4.167 36.506 13.4944 45.83325 25.00025 45.83325Z"
                  stroke="#E82485"
                  stroke-width="4"
                  stroke-linecap="round"
                ></path>
                <path
                  d="M16.667 18.8542V18.645875M33.33375 18.8542V18.645875"
                  stroke="#E82485"
                  stroke-width="4"
                  stroke-linecap="round"
                ></path>
                <path
                  d="M33.33375 29.16675C32.292 32.29175 29.6045 35.41675 25.00025 35.41675C20.39615 35.41675 17.70865 32.29175 16.667 29.16675"
                  stroke="#E82485"
                  stroke-width="4"
                  stroke-linecap="round"
                  stroke-linejoin="round"
                ></path>
              </svg>
              <h3>Устойчивая психика</h3>
              <p>
                Помимо учёбы дети занимаются йогой и арт-терапией, формируя
                устойчивую психику к адаптации пубертатного периода
              </p>
            </div>
          </div>
        </div>

        <div className="reveal ">
          <h2>
            Интересные<span className="colored-span"> факты</span>
          </h2>
          <div className="facts">
            <div>
              <h1>90%</h1>
              <p>информации, что дает современное образование, не пригодится в жизни</p>
            </div>
            <div>
              <h1>80%</h1>
              <p>выпускников современной системы образования страдают психическими расстройствами</p>
            </div>
            <div>
              <h1>93%</h1>
              <p>выпускников современной системы образования имеют хронические заболевания</p>
            </div>
            <div>
              <h1 id="facts__large_block">98%</h1>
              <p>детей в современной системе образования теряют свою гениальность</p>
            </div>
          </div>
        </div>
      </div>
    </section>
  );
};

export default About;
